src/Catalogs/Scan_ШаблоныУсловийОплаты/Scan_ШаблоныУсловийОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ШаблоныУсловийОплаты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>STD</name>
      <description>тип спецификации - STD</description>
    </items>
    <items>
      <name>UOUUO</name>
      <description>тип спецификации - UO/UUO</description>
    </items>
  </predefined>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ПраваИНастройки/Scan_ПраваИНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ПраваИНастройки</name>
  <comment>Хранит права доступа и настройки окружения пользователей</comment>
  <resources>
    <name>Значение</name>
    <comment>Значение права / настройки</comment>
    <type>
      <types>Characteristic.Scan_ПраваИНастройки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, на уровне которого производится настройка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравоНастройка</name>
    <comment>Право или настройка, по которой хранится значение</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.Scan_ПраваИНастройки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ВидыРасчетаДатыОплаты/Scan_ВидыРасчетаДатыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыРасчетаДатыОплаты</name>
  <enumValues>
    <name>ОтДатыДоговора</name>
  </enumValues>
  <enumValues>
    <name>ДоДатыОтгрузкиDDS</name>
  </enumValues>
  <enumValues>
    <name>ОтДатыОтгрузкиDDS</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ВидыОплат/Scan_ВидыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыОплат</name>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Постоплата</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_ШаблоныУсловийОплаты/ObjectModule.bsl
//rarus vikhle 28.06.2021 АПК +-
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	//rarus vikhle 11.06.2021 mt 17637 +++
	Если Не ЭтоГруппа Тогда //rarus vikhle 21.06.2021 mt 17637
		ОбщийПроцент = УсловияОплаты.Итог("ПроцентОплаты");
		Если НЕ ОбщийПроцент = 100 Тогда 
			СтрокаПостоплаты = УсловияОплаты.Найти(Перечисления.Scan_ВидыРасчетаДатыОплаты.ОтДатыОтгрузкиDDS,"РасчетДатыОплаты");
			Если СтрокаПостоплаты = Неопределено Тогда
				СтрокаПостоплаты 					= УсловияОплаты.Добавить();
				СтрокаПостоплаты.ВидОплаты			= Перечисления.Scan_ВидыОплат.Постоплата;
				СтрокаПостоплаты.ПроцентОплаты		= 100 - ОбщийПроцент;
				СтрокаПостоплаты.СрокОплатыАванса 	= 30;
				СтрокаПостоплаты.РасчетДатыОплаты	= ПредопределенноеЗначение("Перечисление.Scan_ВидыРасчетаДатыОплаты.ОтДатыОтгрузкиDDS");
			Иначе
				СтрокаПостоплаты.ПроцентОплаты		= 100 - ОбщийПроцент; 
			КонецЕсли;	
		КонецЕсли;	
		//rarus vikhle 11.06.2021 mt 17637 ---
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) // Rarus tenkam 29.03.2022 mantis 19033 +++
		
	Если ЗначениеЗаполнено(Ссылка) И Модифицированность() Тогда
		// Проверим, не установлен ли шаблон в настройках
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ПраваИНастройки.ПравоНастройка.Код КАК Код,
		|	Scan_ПраваИНастройки.ПравоНастройка КАК ПравоНастройка,
		|	Scan_ПраваИНастройки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.Scan_ПраваИНастройки КАК Scan_ПраваИНастройки
		|ГДЕ
		|	Scan_ПраваИНастройки.Значение = &Значение";
		
		Запрос.УстановитьПараметр("Значение", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ВывестиСообщениеПол(НСтр("ru='Не удалось записать изменения. Шаблон указан в настройке %1 <%2>.'"),,,,,ВыборкаДетальныеЗаписи.Код, ВыборкаДетальныеЗаписи.ПравоНастройка);	
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;                                                 
	
КонецПроцедуры // Rarus tenkam 29.03.2022 mantis 19033 ---

#КонецОбласти

//rarus vikhle 28.06.2021 АПК++
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
//rarus vikhle 28.06.2021 ---
